In [123]:
import pandas as pd
import sklearn as sk
import numpy as np
from sklearn.model_selection import train_test_split

#### import file csv

In [124]:
df = pd.read_csv("income_evaluation.csv")

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              32561 non-null  int64
 1    workclass       32561 non-null  object
 2    fnlwgt          32561 non-null  int64
 3    education       32561 non-null  object
 4    education-num   32561 non-null  int64
 5    marital-status  32561 non-null  object
 6    occupation      32561 non-null  object
 7    relationship    32561 non-null  object
 8    race            32561 non-null  object
 9    sex             32561 non-null  object
 10   capital-gain    32561 non-null  int64
 11   capital-loss    32561 non-null  int64
 12   hours-per-week  32561 non-null  int64
 13   native-country  32561 non-null  object
 14   income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [126]:
df.head(5)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

#### Membagi dataset menjadi training set dan testing set dengan proporsi 70:30

In [127]:
x = df.iloc[:,:-1]
y = df.iloc[:,-1]

#### 0.3 itu sama aja 70:30

In [128]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size = 0.3)

#### untuk melihat jumlah record dari X_train, X_test dan y_train, y_test

In [129]:
print("Dimensi X_train : ", x_train.shape)
print("Dimensi X_test : ", x_test.shape)
print("Dimensi y_train : ", y_train.shape)
print("Dimensi y_test : ", y_test.shape)

Dimensi X_train :  (22792, 14)
Dimensi X_test :  (9769, 14)
Dimensi y_train :  (22792,)
Dimensi y_test :  (9769,)

## Normalisasi data

In [130]:
from sklearn.preprocessing import MinMaxScaler

##### mengcopy dataset

In [131]:
df_kotor = df.copy()

#### Memanggil fungsi minmaxscaler

In [132]:
MinMaxScaler = MinMaxScaler()

#### Melihat columns yang ada

In [133]:
df_kotor.columns

Index(['age', ' workclass', ' fnlwgt', ' education', ' education-num',
       ' marital-status', ' occupation', ' relationship', ' race', ' sex',
       ' capital-gain', ' capital-loss', ' hours-per-week', ' native-country',
       ' income'],
      dtype='object')

#### proses normalisasi data

In [134]:
x_scaler = MinMaxScaler.fit_transform(df_kotor[["age"," hours-per-week"]])

In [135]:
df2 = pd.DataFrame(x_scaler)
df2

              0         1
0      0.301370  0.397959
1      0.452055  0.122449
2      0.287671  0.397959
3      0.493151  0.397959
4      0.150685  0.397959
...         ...       ...
32556  0.136986  0.377551
32557  0.315068  0.397959
32558  0.561644  0.397959
32559  0.068493  0.193878
32560  0.479452  0.397959

[32561 rows x 2 columns]

#### Melakukan Standarisasi pada dataset

In [136]:
from sklearn.preprocessing import StandardScaler

#### Membuat copy dataset

In [137]:
df_kotor2 = df.copy()

#### Memanggil fungsi standardscaler

In [138]:
ss = StandardScaler()

In [139]:
Scaled_data = ss.fit_transform(df_kotor2[[" fnlwgt"," education-num"]])

#### Menampilkan nilai sebelum standarisasi dan setelah standar deviasi

In [140]:
print("Nilai sebelum standarisasi ")
print("Standar Deviasi :", np.std(df_kotor2[[" fnlwgt"," education-num"]]))

Nilai sebelum standarisasi
Standar Deviasi :  fnlwgt           105548.356881
 education-num         2.572681
dtype: float64

## Data Cleaning

### Mengubah salah satu baris menjadi nan
- baris 0 kolom 1 yaitu workclass

In [141]:
df.iloc[0,1] = np.nan

#### Melihat data yang null

In [142]:
df.isna().sum()

age                0
 workclass         1
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

In [143]:
from sklearn.impute import SimpleImputer

#### Menggunakan modus

In [144]:
imputer_mean = SimpleImputer(strategy = 'mean')
imputer_median = SimpleImputer(strategy = 'median')
imputer_most_frequent = SimpleImputer(strategy = 'most_frequent')

#### proses clean data, data tulisan menggunakan modus dengan menimpa data

In [145]:
df[' workclass'] = imputer_most_frequent.fit_transform(df[[' workclass']])

#### menampilkan data yang awalnya null menjadi tidak ada

In [146]:
df.isna().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

#### datanya adalah bilangan bulat 
- mengubah salah satu baris menjadi nan
- baris 0 kolom 4 yaitu education-num

In [147]:
df.iloc[0,4] = np.nan
df.isna().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     1
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

#### Menimpa data yang sebelumnya

In [148]:
df[' education-num'] = imputer_median.fit_transform(df[[' education-num']])

#### berhasil cleaning data yang bilangan bulat dengan median

In [149]:
df.isna().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

#### Mengubah type data int menjadi float di kolom hours-per-week

In [150]:
df[" hours-per-week"] = df[" hours-per-week"].astype("float64")
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,Private,77516,Bachelors,10.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13.0,United-States,<=50K
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40.0,United-States,<=50K
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40.0,United-States,<=50K
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40.0,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12.0,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38.0,United-States,<=50K
32557,40,Private,154374,HS-grad,9.0,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40.0,United-States,>50K
32558,58,Private,151910,HS-grad,9.0,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40.0,United-States,<=50K
32559,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,Own-child,White,Male,0,0,20.0,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40.0,United-States,>50K

### Mengubah salah satu baris menjadi nan
- baris 0 kolom 12 yaitu hours-per-week

In [151]:
df.iloc[0,12] = np.nan
df.isna().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    1
 native-country    0
 income            0
dtype: int64

#### Menimpa data yang sebelumnya

In [152]:
df[' hours-per-week'] = imputer_mean.fit_transform(df[[' hours-per-week']])

#### melihat hasil data yang diclean

In [153]:
df.isna().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

## Data Cleaning dengan nilai duplicate

In [154]:
df.duplicated().sum()

24

In [155]:
df.drop_duplicates(inplace=True)

In [156]:
df.duplicated().sum()

0

#### Mengubah nilai salah satu attribute bertipe angka
- mengubah attribute bertipe int64 menjadi float64

In [157]:
df[" capital-gain"] = df[" capital-gain"].astype("float64")
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,Private,77516,Bachelors,10.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0,40.437469,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0,13.000000,United-States,<=50K
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0,40.000000,United-States,<=50K
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0,40.000000,United-States,<=50K
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0,40.000000,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12.0,Married-civ-spouse,Tech-support,Wife,White,Female,0.0,0,38.000000,United-States,<=50K
32557,40,Private,154374,HS-grad,9.0,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0.0,0,40.000000,United-States,>50K
32558,58,Private,151910,HS-grad,9.0,Widowed,Adm-clerical,Unmarried,White,Female,0.0,0,40.000000,United-States,<=50K
32559,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,Own-child,White,Male,0.0,0,20.000000,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024.0,0,40.000000,United-States,>50K

### One hot Encoding

In [158]:
from sklearn.preprocessing import OneHotEncoder

In [159]:
one_hot_encoder = OneHotEncoder(sparse=False)

#### mengubah kolom kategorikal menjadi numerik di kolom sex

In [161]:
df_encoding = one_hot_encoder.fit_transform(df[[' sex']])
df_encoding = pd.DataFrame(df_encoding)
df = df.join(df_encoding)
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income,0,1
0,39,Private,77516,Bachelors,10.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0,40.437469,United-States,<=50K,0.0,1.0
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0,13.000000,United-States,<=50K,0.0,1.0
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0,40.000000,United-States,<=50K,0.0,1.0
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0,40.000000,United-States,<=50K,0.0,1.0
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0,40.000000,Cuba,<=50K,1.0,0.0